"""Транслитератор. Переводит символы кириллицы в латиницу
"""
def latinizator(word):
    legend = {
      'а':'a',
      'a':'a',
      'б':'b',
      'в':'v',
      'г':'g',
      'д':'d',
      'е':'e',
      'ё':'yo',
      'ж':'zh',
      'з':'z',
      'и':'i',
      'й':'y',
      'к':'k',
      'л':'l',
      'м':'m',
      'н':'n',
      'о':'o',
      'п':'p',
      'р':'r',
      'с':'s',
      'т':'t',
      'у':'u',
      'ф':'f',
      'х':'h',
      'ц':'c',
      'ч':'ch',
      'ш':'sh',
      'щ':'shch',
      'ъ':'',
      'ы':'y',
      'ь':'',
      'э':'e',
      'ю':'yu',
      'я':'ya',
      ' ':' '
    }
    new_word = [legend[letter.lower()] for letter in word]
    return ''.join(new_word)

if __name__ == '__main__':
      print(latinizator('Я у мамы программист'))